import React from 'react';
import NewsContent from '../../../components/NewsContent/NewsContent';
import NavPath from '@/app/components/NavPath/NavPath';
import { Locale } from '@/i18n.config';
import { getDictionary } from '@/lib/dictionary';

interface SpanItem {
    value: string;
}

interface ContentBlock {
    type: 'h2' | 'paragraph' | 'list' | 'image';
    value: string | (string | SpanItem)[];
    listType?: 'numbered' | 'bullet';
    alt?: string;
    number?: string;
}

interface NewsItem {
    id: number;
    title: string;
    content: ContentBlock[];
}

const newsData: NewsItem[] = [
    {
        id: 1,
        title: 'Новина 1',
        content: [
            {
                type: 'paragraph',
                value: [
                    'Текстологічно поспішно розробляться, тобто буле суща кількока років тому може стати застарілим. Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів  Зміни є єдиною постійною в нашому світі, і це особливо очевидно на прикладі інтернет-технологій. Багато компаній потребують редизайну своїх сайтів з різних причин: одні намагаються випередити конкурентів, інші – зберегти свою аудиторію або привернут нових користувачів. Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів  Зміни є єдиною постійною в нашому світі, і це особливо очевидно на прикладі інтернет-технологій. Багато компаній потребують редизайну своїх сайтів з різних причин: одні намагаються випередити конкурентів, інші – зберегти свою аудиторію або привернут нових користувачів. Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів Регулярний аналіз конкурентів  і творчадення нових елементів  Зміни є єдиною постійною в нашому світі, і це особливо очевидно на прикладі інтернет-технологій. Багато компаній потребують редизайну своїх сайтів з різних причин: одні намагаються випередити конкурентів, інші – зберегти свою аудиторію або привернут нових користувачів.',
                    { value: 'допоможуть відловити вимоги користувачів' },
                    ' та підтрумувати актуальність вашого сайту.',
                ],
            },
            {
                type: 'list',
                listType: 'bullet',
                value: ['Візуальний аспект', 'Функціональні зміни', 'Технічні роботи', 'Глибока реклама'],
            },
            { type: 'image', value: '/images/blog/1.png', alt: 'Опис зображення' },
            { type: 'h2', number: '01', value: 'TEST' },
            {
                type: 'paragraph',
                value: [
                    'Текстологічно поспішно розробляться, тобто буле суща кількока років тому може стати застарілим. Регулярний аналіз конкурентів і творчадення нових елементів ',
                    { value: 'допоможуть відловити вимоги користувачів' },
                    ' та підтрумувати актуальність вашого сайту.',
                ],
            },
            {
                type: 'paragraph',
                value: [
                    'Текстологічно поспішно розробляться, тобто буле суща кількока років тому може стати застарілим. Регулярний аналіз конкурентів і творчадення нових елементів ',
                    { value: 'допоможуть відловити вимоги користувачів' },
                    ' та підтрумувати актуальність вашого сайту.',
                ],
            },
            {
                type: 'paragraph',
                value: [
                    'Текстологічно поспішно розробляться, тобто буле суща кількока років тому може стати застарілим. Регулярний аналіз конкурентів і творчадення нових елементів ',
                    { value: 'допоможуть відловити вимоги користувачів' },
                    ' та підтрумувати актуальність вашого сайту.',
                ],
            },
            {
                type: 'paragraph',
                value: [
                    'Текстологічно поспішно розробляться, тобто буле суща кількока років тому може стати застарілим. Регулярний аналіз конкурентів і творчадення нових елементів ',
                    { value: 'допоможуть відловити вимоги користувачів' },
                    ' та підтрумувати актуальність вашого сайту.',
                ],
            },
            {
                type: 'list',
                listType: 'numbered',
                value: ['Візуальний аспект', 'Функціональні зміни', 'Технічні роботи', 'Глибока реклама'],
            },
        ],
    },
];

type Props = {
    params: Promise<{ lang: Locale; id: string }>;
};

async function NewsPage({ params }: Props) {
    const { lang, id } = await params; // Очікуємо розв’язання Promise
    const dictionary: any = await getDictionary(lang);
    const { navPath } = dictionary;
    const newsId = parseInt(id);
    const news = newsData.find((item) => item.id === newsId);

    if (!news) {
        return <div>Новина не знайдена</div>;
    }

    return (
        <div>
            <NavPath dictionary={navPath} />
            <NewsContent content={news.content} title={news.title} />
        </div>
    );
}

export default NewsPage;